app/controllers/forums_controller.rb

  def index
    @forums = Forum.all
---
SELECT "forums".* FROM "forums"

  def show
  @forums = Forum.find(params[:id])
 @question=Question.new
  #@questions=Question.all
 #@question_forum= Question.where("forum_id"=> "params[:forum_id]");
 @questions = Question.where("forum_id = ?",@forum.id)
---
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @forum = Forum.new(forum_params)

    respond_to do |format|
      if @forum.save
---
INSERT INTO "forums" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ruby on Rails"], ["description", "add your question related to ruby on rails"], ["created_at", "2015-12-31 07:34:37.529041"], ["updated_at", "2015-12-31 07:34:37.529041"]]

  def destroy
    @forum.destroy
---
DELETE FROM "forums" WHERE "forums"."id" = ?  [["id", 2]]

    def set_forum
      @forum = Forum.find(params[:id])
---
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 2]]