app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY last_post_at DESC
---
  def index
@forum=Forum.all
    @questions = Question.all

INSERT INTO "questions" ("name", "last_poster_id", "last_post_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "What is Ruby on rails"], ["last_poster_id", 1], ["last_post_at", "2015-12-31 08:39:00.000000"], ["created_at", "2015-12-31 08:40:03.948314"], ["updated_at", "2015-12-31 08:40:03.948314"]]
---
  def create

    @question= Question.new(question_params)

    respond_to do |format|
      if @question.save

DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 4]]
---
  def destroy
    @question.destroy

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_question
      @question = Question.find(params[:id])